Revit 2024 API
BuiltInFailures.SketchFailures.NotOneLoop Property
 More than one loop not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotOneLoop { get; }
Visual Basic
Public Shared ReadOnly Property NotOneLoop As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotOneLoop {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace